#------------------------------------------------
# TAP
#------------------------------------------------

tap "azure/functions"
tap "hashicorp/tap"
tap "nats-io/nats-tools"
tap "ngrok/ngrok"
tap "steipete/tap"
tap "tinygo-org/tools"
tap "tursodatabase/tap"
tap "twilio/brew"

#------------------------------------------------
# BREW
#------------------------------------------------

brew "cloc"
brew "cmake"
brew "direnv"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "httpie"
brew "hub"
brew "huggingface-cli"
brew "jq"
brew "libev"
brew "libffi"
brew "libzip"
brew "llama.cpp"
brew "mise"
brew "neovim"
brew "nmap"
brew "openssl"
brew "pygments"
brew "rename"
brew "ripgrep"
brew "stow"
brew "trash", link: true
brew "tree"
brew "wget"

#------------------------------------------------
# CASKS
#------------------------------------------------

cask "git-credential-manager"

#------------------------------------------------
# VSCODE
#------------------------------------------------

vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.github-vscode-theme"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "jnoortheen.nix-ide"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mikestead.dotenv"
vscode "moalamri.inline-fold"
vscode "redhat.vscode-xml"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vunguyentuan.vscode-css-variables"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"