# Install by running `brew tap Homebrew/bundle && brew bundle`
# Learn more here: https://github.com/Homebrew/homebrew-bundle

# Git repos
tap 'caskroom/cask'
tap 'homebrew/completions'

# OSX Applications and binaries
#cask 'alfred'
#cask 'appzapper'
#cask 'balsamiq-mockups'
#cask 'bartender'
#cask 'burn'
#cask 'chronomate'
##cask 'clear'
#cask 'cloud'
#cask 'cyberduck'
#cask 'dropbox'
#cask 'duet'
#cask 'fantastical'
#cask 'flexiglass'
#cask 'flux'
#cask 'google-chrome'
#cask 'iterm2'
#cask 'lastpass'
#cask 'little-snitch'
#cask 'littleipsum'
#cask 'mailbox'
##cask 'mattercontrol'
#cask 'minecraft'
#cask 'omnigraffle'
#cask 'openscad'
#cask 'pandora'
##cask 'pixelmator'
#cask 'psequel'
#cask 'rdm'
#cask 'rescuetime'
#cask 'robomongo'
#cask 'sequel-pro'
#cask 'slack'
#cask 'spotify'
#cask 'sqwiggle'
#cask 'transmission'
#cask 'virtualbox'
#cask 'vlc'
#cask 'vmware-fusion'

# Libraries and packages
brew 'ansible'
brew 'apple-gcc42'
brew 'autoconf'
brew 'autoenv'
brew 'automake'
brew 'bash-completion'
brew 'bazaar'
brew 'berkeley-db'
brew 'boost'
brew 'brew-cask'
brew 'byacc'
brew 'cloc'
brew 'cmake'
brew 'colordiff'
brew 'couchdb'
brew 'cscope'
brew 'ctags'
brew 'dos2unix'
brew 'editorconfig'
brew 'erlang'
brew 'flow'
brew 'fontconfig'
brew 'freetype'
brew 'gd'
brew 'gdbm'
brew 'gengetopt'
brew 'gettext'
brew 'gist'
brew 'git'
brew 'glib'
brew 'gmp'
brew 'go'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'imagesnap'
brew 'irssi'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'json-c'
brew 'leiningen'
brew 'libdnet'
brew 'libevent'
brew 'libffi'
brew 'libgpg-error'
brew 'libiconv'
brew 'libksba'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'macvim'
brew 'mercurial'
brew 'mongodb'
brew 'mysql'
brew 'nasm'
brew 'neovim'
brew 'nmap'
brew 'node'
brew 'nspr'
brew 'nvm'
brew 'openssl'
brew 'openssl098'
brew 'optipng'
brew 'ossp-uuid'
brew 'p7zip'
brew 'pandoc'
brew 'pcre'
brew 'phantomjs'
brew 'pkg-config'
brew 'postgresql'
brew 'python'
brew 'python3'
brew 'qt'
brew 'readline'
brew 'redis'
brew 'ruby'
brew 'selecta'
brew 'spidermonkey'
brew 'sqlite'
brew 'swaks'
brew 'the_silver_searcher'
brew 'tidy'
brew 'tig'
brew 'tlassemble'
brew 'tmux'
brew 'unixodbc'
brew 'webalizer'
brew 'wget'
brew 'wrk'
brew 'xz'
